Repository: domi802/praca_inzynierska
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Substracto
pl: Menedżer Subskrypcji

# login
source: Sign In
pl: Zaloguj si

# register
source: Sign Up
pl: Zarejestruj si

# logout
source: Sign Out
pl: Wyloguj si

# loginToAccount
source: Sign in to your account
pl: Zaloguj si do swojego konta

# registerNewAccount
source: Create a new account
pl: Utwórz nowe konto

source: Email address
pl: Adres email

# enterEmail
source: Enter your email
pl: Wprowadź swój email

# enterPassword
source: Enter your password
pl: Wprowadź swoje haso

# pleaseEnterEmail
source: Please enter your email
pl: Podaj adres email

# pleaseEnterPassword
source: Please enter your password
pl: Podaj haso

# pleaseEnterValidEmail
source: Please enter a valid email address
pl: Podaj prawidowy adres email

# passwordTooShort
source: Password must be at least 6 characters
pl: Haso musi mie co najmniej 6 znaków

source: Reset Password
pl: Reset hasa

# resetPasswordInstruction
source: Enter your email address and we'll send you a link to reset your password.
pl: Podaj adres email, na który wylemy link do resetowania hasa.

# passwordResetSent
source: Password reset link has been sent
pl: Link do resetowania hasa zosta wysany

# sendResetLink
source: Send Link
pl: Wylij link

source: User Profile
pl: Profil użytkownika

source: App Settings
pl: Ustawienia aplikacji

source: Account
pl: Konto

source: Select Language
pl: Wybierz jzyk

source: Select Theme
pl: Wybierz motyw

source: Error
pl: Bd

source: Try Again
pl: Spróbuj ponownie

source: No data to display
pl: Brak danych do wywietlenia

source: Payment Calendar
pl: Kalendarz patnoci

source: This Week
pl: Ten tydzie

source: This Month
pl: Ten miesic

source: Details
pl: Szczegóy

# subscriptionMarkedPaid
source: Subscription marked as paid
pl: Subskrypcja zostaa oznaczona jako opacona

# todaySummary
source: Today's Summary
pl: Podsumowanie dzisiejsze

source: Weekly Summary
pl: Podsumowanie tygodniowe

source: Monthly Summary
pl: Podsumowanie miesiczne

source: Payment Count
pl: Liczba patnoci

source: Total Cost
pl: czny koszt

source: Payments Today
pl: Patnoci dzisiaj

source: Payments This Week
pl: Patnoci w tym tygodniu

source: Payments This Month
pl: Patnoci w tym miesicu

source: No payments today
pl: Brak patnoci na dzisiaj

source: No payments this week
pl: Brak patnoci w tym tygodniu

source: No payments this month
pl: Brak patnoci w tym miesicu

source: My Subscriptions
pl: Moje Subskrypcje

source: All Subscriptions
pl: Wszystkie subskrypcje

source: Due Tomorrow
pl: Patno jutro

source: Due Today
pl: Patno dzisiaj

source: Period
pl: Okres

source: Payment Dates
pl: Daty patnoci

source: Last Payment
pl: Ostatnia patno

source: Pay Today
pl: Patno dzisiaj

# additionalInfo
source: Additional Information
pl: Dodatkowe informacje

source: Reminder
pl: Przypomnienie

source: Created Date
pl: Data utworzenia

source: Enabled
pl: Wczone

source: days before
pl: dni przed

# daysBeforeParam
source: {days} days before
pl: {days} dni przed

source: Subscription Icon
pl: Ikona subskrypcji

source: Cost (PLN)
pl: Koszt (PLN)

source: Type
pl: Typ

source: How Often
pl: Co ile

source: Cost Summary
pl: Podsumowanie kosztów

source: Average Cost per Subscription
pl: rednia koszt na subskrypcj

# perMonth
source: /month
pl: /miesic

source: Expenses by Category
pl: Wydatki wg kategorii

# totalCostWithCurrency
source: Total Cost: {cost} PLN
pl: czny koszt: {cost} PLN

source: Password
pl: Haso

source: First Name
pl: Imi

source: Last Name
pl: Nazwisko

source: Confirm Password
pl: Potwierdź haso

source: Forgot Password?
pl: Zapomniae hasa?

# dontHaveAccount
source: Don't have an account?
pl: Nie masz konta?

# alreadyHaveAccount
source: Already have an account?
pl: Masz już konto?

source: Create Account
pl: Utwórz konto

source: Sign in with Google
pl: Zaloguj si przez Google

source: or
pl: lub

# main
source: Home
pl: Gówna

source: Calendar
pl: Kalendarz

source: Add
pl: Dodaj

# stats
source: Statistics
pl: Statystyki

source: Profile
pl: Profil

source: Subscriptions
pl: Subskrypcje

source: Add Subscription
pl: Dodaj subskrypcj

source: Edit Subscription
pl: Edytuj subskrypcj

source: Subscription Details
pl: Szczegóy subskrypcji

source: Subscription Name
pl: Nazwa subskrypcji

source: Category
pl: Kategoria

source: Cost
pl: Koszt

source: Currency
pl: Waluta

source: Next Payment
pl: Nastpna patno

source: Payment Period
pl: Okres patnoci

source: Notes
pl: Notatki

source: Icon
pl: Ikona

source: Save
pl: Zapisz

source: Cancel
pl: Anuluj

source: Confirm
pl: Zatwierdź

source: Delete
pl: Usu

source: Edit
pl: Edytuj

source: daily
pl: codziennie

source: weekly
pl: tygodniowo

source: monthly
pl: miesicznie

source: yearly
pl: rocznie

source: Entertainment
pl: Rozrywka

source: Music
pl: Muzyka

source: Gaming
pl: Gry

source: Productivity
pl: Produktywno

source: Education
pl: Edukacja

source: Health
pl: Zdrowie

source: Shopping
pl: Zakupy

source: Other
pl: Inne

source: Mark as Paid
pl: Oznacz jako opacone

source: Delete Subscription
pl: Usu subskrypcj

source: Upcoming Payments
pl: Nadchodzce patnoci

source: Overdue Payments
pl: Zalege patnoci

source: No Subscriptions
pl: Brak subskrypcji

# noSubscriptionsDescription
source: Add your first subscription to start managing your expenses
pl: Dodaj swoj pierwsz subskrypcj, aby zacz zarzdza wydatkami

source: Today
pl: Dzi

source: Tomorrow
pl: Jutro

# daysLeft
source: {days} days left
pl: Zostao {days} dni

source: Overdue
pl: Przeterminowane

source: Total Monthly
pl: cznie miesicznie

source: Total Yearly
pl: cznie rocznie

source: Average per Subscription
pl: rednia na subskrypcj

source: Most Expensive
pl: Najdroższe

source: Cheapest
pl: Najtasze

source: Settings
pl: Ustawienia

source: Edit Profile
pl: Edytuj profil

source: Notifications
pl: Powiadomienia

source: Theme
pl: Motyw

source: Language
pl: Jzyk

source: Security
pl: Bezpieczestwo

source: Change Password
pl: Zmie haso

# lightTheme
source: Light
pl: Jasny

# darkTheme
source: Dark
pl: Ciemny

# systemTheme
source: System
pl: Systemowy

source: Polish
pl: Polski

source: English
pl: Angielski

source: Current Password
pl: Obecne haso

source: New Password
pl: Nowe haso

source: Confirm New Password
pl: Potwierdź nowe haso

source: Enter current password
pl: Wprowadź obecne haso

source: Enter new password
pl: Wprowadź nowe haso

# passwordRequirements
source: Password must be at least 6 characters and contain at least one digit, one uppercase letter, and one special character.
pl: Nowe haso musi mie co najmniej 6 znaków i zawiera litery oraz cyfry.

source: Passwords do not match
pl: Hasa nie s identyczne

source: Enable Notifications
pl: Wcz powiadomienia

# reminderDays
source: Reminder Days Before
pl: Dni przypomnienia wczeniej

source: Notification Time
pl: Czas powiadomienia

# hello
source: Hello {name}!
pl: Witaj {name}!

# errorGeneral
source: An error occurred. Please try again.
pl: Wystpi bd. Spróbuj ponownie.

# errorNetwork
source: Network error. Check your connection.
pl: Bd sieci. Sprawdź poczenie.

# errorAuth
source: Authentication error. Please sign in again.
pl: Bd uwierzytelnienia. Zaloguj si ponownie.

# errorInvalidEmail
source: Invalid email address
pl: Nieprawidowy adres email

# errorWeakPassword
source: Password is too weak
pl: Haso jest za sabe

# errorEmailAlreadyInUse
source: Email is already in use
pl: Email jest już używany

# errorUserNotFound
source: User not found
pl: Użytkownik nie znaleziony

# errorWrongPassword
source: Wrong password
pl: Nieprawidowe haso

# errorPasswordMismatch
source: Passwords don't match
pl: Hasa nie pasuj do siebie

source: Success
pl: Sukces

# subscriptionAdded
source: Subscription added successfully
pl: Subskrypcja zostaa dodana

# subscriptionUpdated
source: Subscription updated successfully
pl: Subskrypcja zostaa zaktualizowana

# subscriptionDeleted
source: Subscription deleted successfully
pl: Subskrypcja zostaa usunita

# profileUpdated
source: Profile updated successfully
pl: Profil zosta zaktualizowany

# passwordChanged
source: Password changed successfully
pl: Haso zostao zmienione

# confirmDelete
source: Are you sure you want to delete this subscription?
pl: Czy na pewno chcesz usun t subskrypcj?

# confirmLogout
source: Are you sure you want to sign out?
pl: Czy na pewno chcesz si wylogowa?

source: Yes
pl: Tak

source: No
pl: Nie

source: Enter subscription name
pl: Wprowadź nazw subskrypcji

source: Enter cost
pl: Wprowadź koszt

source: Select category
pl: Wybierz kategori

source: Select icon
pl: Wybierz ikon

# enterNotes
source: Enter notes (optional)
pl: Wprowadź notatki (opcjonalnie)

source: Select date
pl: Wybierz dat

source: Enter first name
pl: Wprowadź imi

source: Enter last name
pl: Wprowadź nazwisko

# pleaseEnterFirstName
source: Please enter your first name
pl: Podaj swoje imi

# pleaseEnterLastName
source: Please enter your last name
pl: Podaj swoje nazwisko

source: Email cannot be changed
pl: Email nie może by zmieniony

source: Account email
pl: Email konta

source: Save changes
pl: Zapisz zmiany

# validation_required
source: This field is required
pl: To pole jest wymagane

# validation_email
source: Please enter a valid email address
pl: Wprowadź prawidowy adres email

# validation_password
source: Password must be at least 6 characters
pl: Haso musi mie co najmniej 6 znaków

# validation_passwordMatch
source: Passwords must match
pl: Hasa musz by identyczne

# validation_cost
source: Please enter a valid cost
pl: Wprowadź prawidowy koszt

# validation_name
source: Enter valid first/last name
pl: Wprowadź prawidowe imi/nazwisko

source: Payment: {date}
pl: Patno: {date}

source: Subscription marked as paid
pl: Subskrypcja zostaa oznaczona jako opacona

# allCurrentSubscriptionsPaid
source: All current subscriptions are paid
pl: Wszystkie bieżce subskrypcje s opacone

source: Payment tomorrow
pl: Patno jutro

# daysUntilPayment
source: {days} days until payment
pl: {days} dni do patnoci

# addFirstSubscription
source: Add your first subscription to start managing expenses
pl: Dodaj swoj pierwsz subskrypcj, aby zacz zarzdza wydatkami

# confirmDeleteSubscription
source: Are you sure you want to delete subscription "{title}"? This operation cannot be undone.
pl: Czy na pewno chcesz usun subskrypcj "{title}"? Tej operacji nie można cofn.

source: Marking as paid...
pl: Oznaczanie jako opacone...

source: Enter valid cost
pl: Podaj prawidowy koszt

source: Update subscription
pl: Zaktualizuj subskrypcj

source: Next payment date
pl: Data nastpnej patnoci

# paymentDateLabel
source: Payment Date
pl: Data patnoci

# paymentOverdue
source: Payment overdue ({days} days)
pl: Patno przeterminowana ({days} dni)

# paymentInDays
source: Payment in {days} days
pl: Patno za {days} dni

source: Authentication error
pl: Bd uwierzytelnienia

# defaultIcon
source: Default
pl: Domylna

source: Subscription not found
pl: Subskrypcja nie zostaa znaleziona

source: Disabled
pl: Wyczone

source: Create new account
pl: Utwórz nowe konto

# fillFormToCreateAccount
source: Fill the form to create account
pl: Wypenij formularz aby zaoży konto

source: Provide first name
pl: Podaj imi

# firstNameMinLength
source: First name must be at least 2 characters
pl: Imi musi mie co najmniej 2 znaki

# lastNameMinLength
source: Last name must be at least 2 characters
pl: Nazwisko musi mie co najmniej 2 znaki

# provideValidEmail
source: Provide valid email address
pl: Podaj prawidowy adres email

source: Provide password
pl: Podaj haso

# passwordMinLength
source: Password must be at least 6 characters
pl: Haso musi mie co najmniej 6 znaków

source: Enter password again
pl: Wprowadź haso ponownie

# repeatPasswordField
source: Repeat password
pl: Powtórz haso

# passwordsNotMatch
source: Passwords are not identical
pl: Hasa nie s identyczne

# alreadyHaveAccountQuestion
source: Already have an account?
pl: Masz już konto?

source: every 3 days
pl: co 3 dni

# biweekly
source: every 2 weeks
pl: co 2 tygodnie

source: quarterly
pl: co kwarta

# paymentHistory
source: Payment dates
pl: Daty patnoci

# lastPaymentLabel
source: Last payment
pl: Ostatnia patno

# nextPaymentLabel
source: Next payment
pl: Nastpna patno

source: Additional information
pl: Dodatkowe informacje

source: Creation date
pl: Data utworzenia

# markAsPaidButton
source: Mark as paid
pl: Oznacz jako opacona

# deleteButton
source: Delete
pl: Usu

# periodDaily
source: daily
pl: codziennie

# periodWeekly
source: weekly
pl: tygodniowo

# periodMonthly
source: monthly
pl: miesicznie

# periodYearly
source: yearly
pl: rocznie

# period3Days
source: every 3 days
pl: co 3 dni

# periodBiweekly
source: biweekly
pl: co 2 tygodnie

# periodQuarterly
source: quarterly
pl: co kwarta

# addSubscriptionsToSeeStats
source: Add subscriptions to see statistics
pl: Dodaj subskrypcje, aby zobaczy statystyki

source: Payment periods
pl: Okresy patnoci

source: Most expensive subscriptions
pl: Najdroższe subskrypcje

# noPaymentsNext7Days
source: No payments in the next 7 days
pl: Brak patnoci w cigu najbliższych 7 dni

# subscriptionTitle
source: Subscription name
pl: Nazwa subskrypcji

source: Subscription cost
pl: Koszt subskrypcji

source: Reminder (days before)
pl: Przypomnienie (dni przed)

# editMenuItem
source: Edit
pl: Edytuj

# viewMenuItem
source: Details
pl: Szczegóy

# markAsPaidMenuItem
source: Mark as paid
pl: Oznacz jako opacone

# deleteMenuItem
source: Delete
pl: Usu

# everyXDays
source: Every {days} days
pl: Co {days} dni

# everyXWeeks
source: Every {weeks} weeks
pl: Co {weeks} tygodni

# everyXMonths
source: Every {months} months
pl: Co {months} miesic(e)

# everyXYears
source: Every {years} years
pl: Co {years} lat(a)

source: Category Breakdown
pl: Podzia wedug kategorii

source: Total Amount
pl: Cakowita kwota

source: Average per Month
pl: rednia na miesic

# categoryEntertainment
source: Entertainment
pl: Rozrywka

# categoryMusic
source: Music
pl: Muzyka

# categoryGames
source: Games
pl: Gry

# categoryProductivity
source: Productivity
pl: Produktywno

# categoryEducation
source: Education
pl: Edukacja

# categoryHealth
source: Health
pl: Zdrowie

# categoryFinance
source: Finance
pl: Finanse

# categoryOther
source: Other
pl: Inne

# periodType
source: Type
pl: Typ

# periodInterval
source: Every
pl: Co ile

source: Payment today
pl: Patno dzi

source: Paid this month
pl: Opacone w tym miesicu

# daysToPayment
source: {days} days until payment
pl: {days} dni do patnoci

# daysShort
source: {days} days
pl: {days} dni

# monthlyLabel
source: Monthly
pl: Miesicznie

# yearlyLabel
source: Yearly
pl: Rocznie

# subscriptionNotFoundForEdit
source: Subscription not found for editing
pl: Nie znaleziono subskrypcji do edycji

# subscriptionNameHint
source: e.g. Netflix, Spotify...
pl: np. Netflix, Spotify...

# notesHint
source: Additional information...
pl: Dodatkowe informacje...

# loadingChangingPassword
source: Changing password...
pl: Zmiana hasa...

# loadingUpdatingProfile
source: Updating profile...
pl: Aktualizowanie profilu...

# loadingUpdatingSubscription
source: Updating subscription...
pl: Aktualizowanie subskrypcji...

# loadingDeletingSubscription
source: Deleting subscription...
pl: Usuwanie subskrypcji...

# loadingMarkingAsPaid
source: Marking as paid...
pl: Oznaczanie jako opacone...

# loadingProcessing
source: Processing...
pl: Przetwarzanie...

# loadingPleaseWait
source: Please wait...
pl: Prosz czeka...

# loadingDefault
source: Loading...
pl: adowanie...

# errorChangingPassword
source: Error while changing password: {error}
pl: Bd podczas zmiany hasa: {error}

# errorInitializingApp
source: Error while initializing app
pl: Bd podczas inicjalizacji aplikacji

source: Error loading app
pl: Bd adowania aplikacji

# errorPageTitle
source: Error
pl: Bd

# errorLogin
source: Error occurred during login
pl: Wystpi bd podczas logowania

# errorRegister
source: Error occurred during registration
pl: Wystpi bd podczas rejestracji

# errorInvalidLogin
source: Invalid login or password
pl: Bdny login lub haso

# errorEmailAlreadyExists
source: Account with this email already exists
pl: Konto z tym adresem email już istnieje

# errorWeakPasswordAuth
source: Password is too weak
pl: Haso jest zbyt sabe

# errorUserDisabled
source: User account has been disabled
pl: Konto użytkownika zostao zablokowane

# errorTooManyRequests
source: Too many login attempts. Please try again later
pl: Zbyt wiele prób logowania. Spróbuj ponownie później

# errorOperationNotAllowed
source: Operation is not allowed
pl: Operacja nie jest dozwolona

# errorNetworkFailed
source: No internet connection
pl: Brak poczenia z internetem

# errorGenericAuth
source: An error occurred. Please try again later
pl: Wystpi bd. Spróbuj ponownie później

# errorUnexpected
source: An unexpected error occurred
pl: Wystpi nieoczekiwany bd

# errorUserDataNotFound
source: User data not found
pl: Nie znaleziono danych użytkownika

source: Verify your email
pl: Zweryfikuj swój email

# checkEmailForVerification
source: Check your inbox and click the verification link.
pl: Sprawdź swoj skrzynk pocztow i kliknij link weryfikacyjny.

source: Check verification
pl: Sprawdź weryfikacj

source: Resend email
pl: Wylij ponownie

source: Hide
pl: Ukryj

# emailVerificationSent
source: Verification email has been sent again
pl: Email weryfikacyjny zosta wysany ponownie

# emailVerified
source: Email has been verified! ðŸŽ‰
pl: Email zosta zweryfikowany!

source: Continue with Google
pl: Kontynuuj z Google

source: Or sign in with
pl: Lub zaloguj si przez

source: Or sign up with
pl: Lub zarejestruj si przez

# enterValidEmail
source: Enter a valid email address
pl: Wprowadź prawidowy adres email
